app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
          <%= form.label :category_id %>
          <% options = options_from_collection_for_select(Category.all, 'id', 'name') %>