app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT  "articles".* FROM "articles" LIMIT ?  [["LIMIT", 1]]

  def create
    parama = params[:article]
    @article = Article.new(category_id: parama[:category], title: parama[:title], lien: parama[:lien], image_url: parama[:image_url],icon_url: parama[:icon_url],description: parama[:description], tuto:parama[:tuto])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("category_id", "title", "lien", "image_url", "icon_url", "description", "tuto", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      parama = params[:article]
      if @article.update(category_id: parama[:category], title: parama[:title], lien: parama[:lien], image_url: parama[:image_url],icon_url: parama[:icon_url],description: parama[:description], tuto:parama[:tuto])
---
UPDATE "articles" SET "category_id" = ?, "title" = ?, "lien" = ?, "image_url" = ?, "icon_url" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["category_id", 1], ["title", "aponga"], ["lien", "www.aponga.com"], ["image_url", "aponga.png"], ["icon_url", "aponga-Convertimage.png"], ["updated_at", "2018-09-18 08:08:40.103904"], ["id", 10]]