app/controllers/pending_articles_controller.rb

SELECT "pending_articles".* FROM "pending_articles"
---
  def index
    @pending_articles = PendingArticle.all

DELETE FROM "pending_articles" WHERE "pending_articles"."id" = ?  [["id", 1]]
---
  def destroy
    @pending_article.destroy

SELECT  "pending_articles".* FROM "pending_articles" WHERE "pending_articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def set_pending_article
      @pending_article = PendingArticle.find(params[:id])